app/Controllers/Customer.php

SELECT *
FROM `customer`
---
    public function index()
    {
        $data_customer = $this->customerModel->findAll();