app/Models/CustomerModel.php

    public function getCustomer()
    {
        return $this->findAll();
---
SELECT *
FROM `customer`

    public function saveCustomer($data)
    {
        return $this->save($data);
---
UPDATE `customer` SET `nik_customer` = '3304042005', `nama_customer` = 'Nur Choerun Nisa ', `jenis_kelamin` = 'Perempuan', `pekerjaan` = 'Mahasiswa', `nomor_telepon` = '088980116975', `alamat` = 'Banjarnegara', `email` = 'nisanurchoerun@gmail'
WHERE `customer`.`nik_customer` IN ('3304042005')